brew "plantuml"
brew "rustup"
brew "coreutils" # for gdate for PS1
brew "openai-whisper"

brew "redis", restart_service: :changed
brew "postgresql@17", restart_service: :changed


brew "stripe"

brew "python-matplotlib"

cask "arc"
cask "zen"
cask "helium-browser"
cask "google-chrome"

cask "betterdisplay"
cask "ghostty"
cask "ngrok"
cask "notion"
cask "signal"
cask "telegram"
cask "visual-studio-code"
cask "cursor"
cask "sonos"
cask "obs"
cask "utm"
cask "transmission"
cask "docker-desktop"
cask "notion-calendar"
cask "protonvpn"
cask "vlc"

cask "gog-galaxy"
cask "steam"
cask "minecraft"
