tap "koekeishiya/formulae"

brew "go"
brew "plantuml"
brew "rustup"
brew "coreutils" # for gdate for PS1
brew "openai-whisper"

brew "redis", restart_service: :changed
brew "postgresql@17", restart_service: :changed

brew "koekeishiya/formulae/skhd"

brew "stripe"

brew "python-matplotlib"

cask "arc"
cask "zen"
cask "helium-browser"
cask "google-chrome"

cask "betterdisplay"
cask "ghostty"
cask "ngrok"
cask "notion"
cask "signal"
cask "telegram"
cask "visual-studio-code"
cask "cursor"
cask "sonos"
cask "obs"
cask "utm"
cask "transmission"
cask "docker-desktop"
cask "notion-calendar"
cask "protonvpn"
cask "vlc"

cask "gog-galaxy"
cask "steam"
cask "minecraft"

vscode "eamodio.gitlens"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "vscodevim.vim"
vscode "aaron-bond.better-comments"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "usernamehw.errorlens"
vscode "ms-vsliveshare.vsliveshare"

# JavaScript/TypeScript
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "yoavbls.pretty-ts-errors"
vscode "bradlc.vscode-tailwindcss"

# Other Languages
vscode "davidanson.vscode-markdownlint"
vscode "rust-lang.rust-analyzer"
vscode "yinfei.luahelper"
