tap "oven-sh/bun"
tap "koekeishiya/formulae"

brew "watch"
brew "htop"
brew "bat"
brew "tree"
brew "eza"
brew "difftastic"
brew "fzf"
brew "gh"
brew "stow"
brew "tmux"
brew "oven-sh/bun/bun"
brew "go"
brew "plantuml"
brew "entr"
brew "act"
brew "shellcheck"
brew "rustup"
brew "coreutils" # for gdate for PS1
brew "prettierd"
brew "codex"
brew "yt-dlp"
brew "openai-whisper"
brew "bash"

brew "redis", restart_service: :changed
brew "postgresql", restart_service: :changed

brew "neovim", args: ["HEAD"]
brew "fd" # recommended for nvim telescope
brew "ripgrep" # required for nvim telescope
brew "shfmt" # required by nvim conform for bash formatting
brew "stylua" # required by nvim conform for lua formatting
brew "luarocks" # lua package manager used by nvim lazy and mason
brew "bash-language-server" # for nvim
brew "tailwindcss-language-server" # for nvim
brew "typescript-language-server" # for nvim
brew "rust-analyzer" # for nvim
brew "gopls" # for nvim
brew "lua-language-server" # for nvim

brew "koekeishiya/formulae/skhd"

cask "arc"
cask "firefox"
cask "zen"

cask "betterdisplay"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "linear-linear"
cask "ngrok"
cask "notion"
cask "raycast"
cask "signal"
cask "telegram"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "cursor"
cask "sonos"
cask "obs"
cask "utm"
cask "transmission"
cask "docker-desktop"
cask "notion-calendar"
cask "protonvpn"
cask "claude-code"
cask "vlc"

cask "audacity"

cask "discord"
cask "gog-galaxy"
cask "steam"

vscode "eamodio.gitlens"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "vscodevim.vim"
vscode "aaron-bond.better-comments"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "usernamehw.errorlens"
vscode "ms-vsliveshare.vsliveshare"

# JavaScript/TypeScript
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "yoavbls.pretty-ts-errors"
vscode "bradlc.vscode-tailwindcss"

# Other Languages
vscode "davidanson.vscode-markdownlint"
vscode "rust-lang.rust-analyzer"
vscode "yinfei.luahelper"
