alsa-lib # needed for firefox/zen
base
base-devel
bat
brightnessctl # control laptop/internal display brightness
difftastic
efibootmgr # modify uefi boot entries
eza
fd
foot
fzf
ghostty
git
github-cli
grub # GNU GRand Unified Bootloader
hyprland
hyprpaper
intel-ucode # Microcode update files for Intel CPUs
jq
less
linux
linux-firmware
man-db
man-pages
networkmanager
nvm
openssh
os-prober # used to configure grub to detect Windows
otf-font-awesome # Used by waybar to display icons
pipewire # Modern audio/video server
pipewire-alsa # ALSA compatibility for PipeWire
pipewire-pulse # PulseAudio compatibility for PipeWire (needed for browsers)
wireplumber # Session manager for PipeWire (provides wpctl)
ripgrep
rustup
shellcheck
shfmt
sof-firmware # Intel Sound Open Firmware (required for laptop audio)
stow
texinfo # GNU documentation system for on-line information and printed output
tmux
ttf-firacode-nerd
vim
waybar
wev # A tool for debugging wayland events on a Wayland window, analogous to the X11 tool xev
wofi
zsh
