alsa-lib # needed for firefox/zen
base
base-devel
bat
brightnessctl # control laptop/internal display brightness
difftastic
eza
fd
foot
fzf
ghostty
git
github-cli
hyprland
jq
less
linux
linux-firmware
man-db
man-pages
networkmanager
nvm
openssh
ripgrep
rustup
stow
tmux
ttf-firacode-nerd
vim
wofi
zsh
