alsa-lib # needed for firefox/zen
base
base-devel
bash-language-server
bat
bluez # Bluetooth protocol stack
bluez-utils # Bluetooth utilities (bluetoothctl, etc.)
brightnessctl # control laptop/internal display brightness
btop
cpupower # get and set power profiles
darkman # switch dark/light mode based on time of day
ddcutil # change external monitor brightness
difftastic
efibootmgr # modify uefi boot entries
eza
fd
firefox
fzf
ghostty
git
github-cli
grim # Screenshot utility for Wayland
grub # GNU GRand Unified Bootloader
hyperfine # cli benchmarking
hyprland
hyprpaper
imagemagick # Used by snacks.image
innoextract # A tool to extract installers created by Inno Setup. (used for king's quest vii)
intel-media-driver # VA-API driver for Intel graphics (hardware video decode)
intel-ucode # Microcode update files for Intel CPUs
jq
less
linux
linux-firmware
lua-language-server
mako
man-db
man-pages
mpc # Minimalist command line interface to MPD
mpd # Music Player Daemon
ncmpcpp # mpc client
networkmanager
nvm
openssh
os-prober # used to configure grub to detect Windows
otf-font-awesome # Used by waybar to display icons
otf-monaspace # github font
pacman-contrib # contains pactree
pavucontrol # GUI Audio manager
pipewire-alsa # ALSA compatibility for PipeWire
pipewire # Modern audio/video server
pipewire-pulse # PulseAudio compatibility for PipeWire (needed for browsers)
python-mutagen # audio metadata tag reader used by mpDris2 to show cover art in notifications
ripgrep
rustup
scummvm # Virtual machine for classic graphical point-and-click adventure games
shellcheck
shfmt
sof-firmware # Intel Sound Open Firmware (required for laptop audio)
spotify-launcher
stow
stylua
texinfo # GNU documentation system for on-line information and printed output
tmux
ttf-firacode-nerd
vim
vulkan-intel
waybar
wev # A tool for debugging wayland events on a Wayland window, analogous to the X11 tool xev
wireplumber # Session manager for PipeWire (provides wpctl)
wofi
xdg-desktop-portal-gtk # GTK portal for darkman theme integration
xdg-desktop-portal-hyprland
xdg-user-dirs # Manage user directories like ~/Music. (used by mpd)
zsh
docker
